app/views/books/new.html.erb

		<%= f.label :category %> <br />
		<%= f.select :category_id, Category.all.collect {|x| [x.name, x.id]}, {:include_blank => 'Select One'},
		class: 'form-control' %> <br />	<br />
---
SELECT `categories`.* FROM `categories`

		<%= f.label :publisher %> <br />
		<%= f.select :publisher_id, Publisher.all.collect {|x| [x.name, x.id]}, {:include_blank => 'Select One'},
		class: 'form-control' %> <br />	<br />
---
SELECT `publishers`.* FROM `publishers`

		<%= f.label :author %> <br />
		<%= f.select :author_id, Author.all.collect {|x| [x.first_name + ' ' + x.last_name, x.id]}, {:include_blank => 'Select One'},
		class: 'form-control' %> <br />	<br />
---
SELECT `authors`.* FROM `authors`