app/controllers/authors_controller.rb

  def create
    @author = Author.new(author_param)
    if @author.save
---
INSERT INTO `authors` (`first_name`, `last_name`, `created_at`, `updated_at`) VALUES ('Scott', 'Raymond', '2019-10-05 12:01:10.036717', '2019-10-05 12:01:10.036717')

  def update
    @author = Author.find(params[:id])

    @author.update(author_param)
---
SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 5 LIMIT 1
UPDATE `authors` SET `authors`.`last_name` = 'fhgfhfgh', `authors`.`updated_at` = '2019-10-07 20:17:32.406152' WHERE `authors`.`id` = 5

  def edit
    @author = Author.find(params[:id])
---
SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 1 LIMIT 1

  def destroy
    @author = Author.find(params[:id])

    @author.destroy
---
SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 4 LIMIT 1
DELETE FROM `authors` WHERE `authors`.`id` = 4