app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    @book.save
---
INSERT INTO `books` (`title`, `category_id`, `author_id`, `publisher_id`, `isbn`, `year`, `price`, `buy`, `excerpt`, `format`, `created_at`, `updated_at`, `coverpath`) VALUES ('test', 1, 3, 1, '54345', '', '', '', '', '', '2019-10-07 17:59:22.404363', '2019-10-07 17:59:22.404363', '')

  def update
    @book = Book.find(params[:id])

    @book.update(book_params)
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
UPDATE `books` SET `books`.`title` = 'Ajax on Rails', `books`.`updated_at` = '2019-10-07 17:56:17.031974' WHERE `books`.`id` = 1

  def index
    @books = Book.all
    @categories = Category.all
---
SELECT `books`.* FROM `books`
SELECT `categories`.* FROM `categories`

  def show
    @book = Book.find(params[:id])
    @categories = Category.all
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 4 LIMIT 1
SELECT `categories`.* FROM `categories`