app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_param)
    if @category.save
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('HTML5', '2019-10-05 11:57:34.417504', '2019-10-05 11:57:34.417504')

  def update
    @category = Category.find(params[:id])

    @category.update(category_param)
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
UPDATE `categories` SET `categories`.`name` = 'Ruby on Rails', `categories`.`updated_at` = '2019-10-07 19:53:22.708853' WHERE `categories`.`id` = 1

  def destroy
    @category = Category.find(params[:id])

    @category.destroy
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
DELETE FROM `categories` WHERE `categories`.`id` = 4

  def show
    @category = Category.find(params[:id])
    @categories = Category.all
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
SELECT `categories`.* FROM `categories`