app/controllers/publishers_controller.rb

  def create
    @publisher = Publisher.new(publisher_param)
     if @publisher.save
---
INSERT INTO `publishers` (`name`, `created_at`, `updated_at`) VALUES ('O\'Reilly Media, Incorporated', '2019-10-06 16:15:08.912033', '2019-10-06 16:15:08.912033')

  def update
    @publisher = Publisher.find(params[:id])

    @publisher.update(publisher_param)
---
SELECT `publishers`.* FROM `publishers` WHERE `publishers`.`id` = 4 LIMIT 1
UPDATE `publishers` SET `publishers`.`name` = 'test22', `publishers`.`updated_at` = '2019-10-07 20:25:05.287869' WHERE `publishers`.`id` = 4

  def edit
    @publisher = Publisher.find(params[:id])
---
SELECT `publishers`.* FROM `publishers` WHERE `publishers`.`id` = 4 LIMIT 1

  def destroy
    @publisher = Publisher.find(params[:id])

    @publisher.destroy
---
SELECT `publishers`.* FROM `publishers` WHERE `publishers`.`id` = 4 LIMIT 1
DELETE FROM `publishers` WHERE `publishers`.`id` = 4

  def index
    @publishers = Publisher.all
---
SELECT `publishers`.* FROM `publishers`